In [1]:
## Load Packages
import pandas as pd
import numpy as np

In [2]:
## Import CSV file
df=pd.read_csv('space_missions.csv', encoding='latin-1')
df.head()

,Company,Location,Date,Time,Rocket,Mission,RocketStatus,Price,MissionStatus
0,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",10/4/1957,19:28:00,Sputnik 8K71PS,Sputnik-1,Retired,NaN,Success
1,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",11/3/1957,2:30:00,Sputnik 8K71PS,Sputnik-2,Retired,NaN,Success
2,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",12/6/1957,16:44:00,Vanguard,Vanguard TV3,Retired,NaN,Failure
3,AMBA,"LC-26A, Cape Canaveral AFS, Florida, USA",2/1/1958,3:48:00,Juno I,Explorer 1,Retired,NaN,Success
4,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",2/5/1958,7:33:00,Vanguard,Vanguard TV3BU,Retired,NaN,Failure

In [3]:
## Total no. of rows and columsn
df.shape

(4630, 9)

In [4]:
## dataset information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4630 entries, 0 to 4629
Data columns (total 9 columns):
Company          4630 non-null object
Location         4630 non-null object
Date             4630 non-null object
Time             4503 non-null object
Rocket           4630 non-null object
Mission          4630 non-null object
RocketStatus     4630 non-null object
Price            1265 non-null float64
MissionStatus    4630 non-null object
dtypes: float64(1), object(8)
memory usage: 325.7+ KB

In [5]:
## Columns with null values
null_data = df.isnull().sum()
null_data[null_data > 0]

Time      127
Price    3365
dtype: int64

In [ ]:
# price to numeric data type
df['Price']= pd.to_numeric(df['Price'])

In [7]:
## Split Countries from Location
df[['Location','Country']]= df["Location"].str.rsplit(",", n=1, expand = True)

In [8]:
df.head()

,Company,Location,Date,Time,Rocket,Mission,RocketStatus,Price,MissionStatus,Country
0,RVSN USSR,"Site 1/5, Baikonur Cosmodrome",10/4/1957,19:28:00,Sputnik 8K71PS,Sputnik-1,Retired,NaN,Success,Kazakhstan
1,RVSN USSR,"Site 1/5, Baikonur Cosmodrome",11/3/1957,2:30:00,Sputnik 8K71PS,Sputnik-2,Retired,NaN,Success,Kazakhstan
2,US Navy,"LC-18A, Cape Canaveral AFS, Florida",12/6/1957,16:44:00,Vanguard,Vanguard TV3,Retired,NaN,Failure,USA
3,AMBA,"LC-26A, Cape Canaveral AFS, Florida",2/1/1958,3:48:00,Juno I,Explorer 1,Retired,NaN,Success,USA
4,US Navy,"LC-18A, Cape Canaveral AFS, Florida",2/5/1958,7:33:00,Vanguard,Vanguard TV3BU,Retired,NaN,Failure,USA

In [9]:
# Total no. of Companies
print(f"Number of companies: {df['Company'].nunique()}")

Number of companies: 62

In [11]:
# Max and Min time periods
df['Date']= pd.to_datetime(df['Date'])
print(f"Max date: {df['Date'].max()}")
print(f"Min date: {df['Date'].min()}")

Max date: 2022-07-29 00:00:00
Min date: 1957-10-04 00:00:00

In [13]:
# List of countries
print(f"Countries: {df['Country'].unique()}")

Countries: [' Kazakhstan' ' USA' ' Russia' ' France' ' Japan' ' Kenya' ' Australia'
 ' China' ' India' ' Israel' ' Gran Canaria' ' Brazil' ' Barents Sea'
 ' North Korea' ' Pacific Ocean' ' Iran' ' South Korea'
 ' Pacific Missile Range Facility' ' New Zealand' ' New Mexico'
 ' Yellow Sea' ' Shahrud Missile Test Site']

In [14]:
df.to_csv('sm_formatted.csv', index = False)